NXP/nxp_tf-m/platform/ext/target/nxp/mcxn5xxevk/Device/Source/startup_mcxn5xxevk.c
extern const VECTOR_TABLE_Type __VECTOR_TABLE[];
       const VECTOR_TABLE_Type __VECTOR_TABLE[] __VECTOR_TABLE_ATTRIBUTE = {
  (VECTOR_TABLE_Type)(&__INITIAL_SP),            /*      Initial Stack Pointer */
  Reset_Handler,                     /* Reset Handler */
  NMI_Handler,                       /* NMI Handler*/
  HardFault_Handler,                 /* Hard Fault Handler*/
  MemManage_Handler,                 /* MPU Fault Handler*/
  BusFault_Handler,                  /* Bus Fault Handler*/
  UsageFault_Handler,                /* Usage Fault Handler*/
  SecureFault_Handler,               /* Secure Fault Handler */
  0,                                 /* Reserved*/
  0,                                 /* Reserved*/
  0,                                 /* Reserved*/
  SVC_Handler,                       /* SVCall Handler*/
  DebugMon_Handler,                  /* Debug Monitor Handler*/
  0,                                 /* Reserved*/
  PendSV_Handler,                    /* PendSV Handler*/
  SysTick_Handler,                   /* SysTick Handler*/

/* External Interrupts*/
  OR_IRQHandler,                               //OR IRQ
  EDMA_0_CH0_IRQHandler,                       //eDMA_0_CH0 error or transfer complete
  EDMA_0_CH1_IRQHandler,                       //eDMA_0_CH1 error or transfer complete
  EDMA_0_CH2_IRQHandler,                       //eDMA_0_CH2 error or transfer complete
  EDMA_0_CH3_IRQHandler,                       //eDMA_0_CH3 error or transfer complete
  EDMA_0_CH4_IRQHandler,                       //eDMA_0_CH4 error or transfer complete
  EDMA_0_CH5_IRQHandler,                       //eDMA_0_CH5 error or transfer complete
  EDMA_0_CH6_IRQHandler,                       //eDMA_0_CH6 error or transfer complete
  EDMA_0_CH7_IRQHandler,                       //eDMA_0_CH7 error or transfer complete
  EDMA_0_CH8_IRQHandler,                       //eDMA_0_CH8 error or transfer complete
  EDMA_0_CH9_IRQHandler,                       //eDMA_0_CH9 error or transfer complete
  EDMA_0_CH10_IRQHandler,                      //eDMA_0_CH10 error or transfer complete
  EDMA_0_CH11_IRQHandler,                      //eDMA_0_CH11 error or transfer complete
  EDMA_0_CH12_IRQHandler,                      //eDMA_0_CH12 error or transfer complete
  EDMA_0_CH13_IRQHandler,                      //eDMA_0_CH13 error or transfer complete
  EDMA_0_CH14_IRQHandler,                      //eDMA_0_CH14 error or transfer complete
  EDMA_0_CH15_IRQHandler,                      //eDMA_0_CH15 error or transfer complete
  GPIO00_IRQHandler,                           //GPIO0 interrupt 0
  GPIO01_IRQHandler,                           //GPIO0 interrupt 1
  GPIO10_IRQHandler,                           //GPIO1 interrupt 0
  GPIO11_IRQHandler,                           //GPIO1 interrupt 1
  GPIO20_IRQHandler,                           //GPIO2 interrupt 0
  GPIO21_IRQHandler,                           //GPIO2 interrupt 1
  GPIO30_IRQHandler,                           //GPIO3 interrupt 0
  GPIO31_IRQHandler,                           //GPIO3 interrupt 1
  GPIO40_IRQHandler,                           //GPIO4 interrupt 0
  GPIO41_IRQHandler,                           //GPIO4 interrupt 1
  GPIO50_IRQHandler,                           //GPIO5 interrupt 0
  GPIO51_IRQHandler,                           //GPIO5 interrupt 1
  UTICK0_IRQHandler,                           //Micro-Tick Timer interrupt
  MRT0_IRQHandler,                             //Multi-Rate Timer interrupt
  CTIMER0_IRQHandler,                          //Standard counter/timer 0 interrupt
  CTIMER1_IRQHandler,                          //Standard counter/timer 1 interrupt
  SCT0_IRQHandler,                             //SCTimer/PWM interrupt
  CTIMER2_IRQHandler,                          //Standard counter/timer 2 interrupt
  LP_FLEXCOMM0_IRQHandler,                     //LP_FLEXCOMM0 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM1_IRQHandler,                     //LP_FLEXCOMM1 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM2_IRQHandler,                     //LP_FLEXCOMM2 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM3_IRQHandler,                     //LP_FLEXCOMM3 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM4_IRQHandler,                     //LP_FLEXCOMM4 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM5_IRQHandler,                     //LP_FLEXCOMM5 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM6_IRQHandler,                     //LP_FLEXCOMM6 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM7_IRQHandler,                     //LP_FLEXCOMM7 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM8_IRQHandler,                     //LP_FLEXCOMM8 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  LP_FLEXCOMM9_IRQHandler,                     //LP_FLEXCOMM9 (LPSPI interrupt or LPI2C interrupt or LPUART Receive/Transmit interrupt)
  ADC0_IRQHandler,                             //Analog-to-Digital Converter 0 - General Purpose interrupt
  ADC1_IRQHandler,                             //Analog-to-Digital Converter 1 - General Purpose interrupt
  PINT0_IRQHandler,                            //Pin Interrupt Pattern Match Interrupt
  PDM_EVENT_IRQHandler,                        //Microphone Interface interrupt
  Reserved65_IRQHandler,                       //Reserved interrupt
  USB0_FS_IRQHandler,                          //Universal Serial Bus - Full Speed interrupt
  USB0_DCD_IRQHandler,                         //Universal Serial Bus - Device Charge Detect interrupt
  RTC_IRQHandler,                              //RTC Subsystem interrupt (RTC interrupt or Wake timer interrupt)
  SMARTDMA_IRQHandler,                         //SmartDMA_IRQ
  MAILBOX_IRQHandler,                          //Inter-CPU Mailbox interrupt0 for CPU0 Inter-CPU Mailbox interrupt1 for CPU1
  CTIMER3_IRQHandler,                          //Standard counter/timer 3 interrupt
  CTIMER4_IRQHandler,                          //Standard counter/timer 4 interrupt
  OS_EVENT_IRQHandler,                         //OS event timer interrupt
  FLEXSPI0_IRQHandler,                         //Flexible Serial Peripheral Interface interrupt
  SAI0_IRQHandler,                             //Serial Audio Interface 0 interrupt
  SAI1_IRQHandler,                             //Serial Audio Interface 1 interrupt
  USDHC0_IRQHandler,                           //Ultra Secured Digital Host Controller interrupt
  CAN0_IRQHandler,                             //Controller Area Network 0 interrupt
  CAN1_IRQHandler,                             //Controller Area Network 1 interrupt
  Reserved80_IRQHandler,                       //Reserved interrupt
  Reserved81_IRQHandler,                       //Reserved interrupt
  USB1_HS_PHY_IRQHandler,                      //USBHS DCD or USBHS Phy interrupt
  USB1_HS_IRQHandler,                          //USB High Speed OTG Controller interrupt
  SEC_HYPERVISOR_CALL_IRQHandler,              //AHB Secure Controller hypervisor call interrupt
  Reserved85_IRQHandler,                       //Reserved interrupt
  PLU_IRQHandler,                              //Programmable Logic Unit interrupt
  Freqme_IRQHandler,                           //Frequency Measurement interrupt
  SEC_VIO_IRQHandler,                          //Secure violation interrupt (Memory Block Checker interrupt or secure AHB matrix violation interrupt)
  ELS_IRQHandler,                              //ELS interrupt
  PKC_IRQHandler,                              //PKC interrupt
  PUF_IRQHandler,                              //Physical Unclonable Function interrupt
  PQ_IRQHandler,                               //Power Quad interrupt
  EDMA_1_CH0_IRQHandler,                       //eDMA_1_CH0 error or transfer complete
  EDMA_1_CH1_IRQHandler,                       //eDMA_1_CH1 error or transfer complete
  EDMA_1_CH2_IRQHandler,                       //eDMA_1_CH2 error or transfer complete
  EDMA_1_CH3_IRQHandler,                       //eDMA_1_CH3 error or transfer complete
  EDMA_1_CH4_IRQHandler,                       //eDMA_1_CH4 error or transfer complete
  EDMA_1_CH5_IRQHandler,                       //eDMA_1_CH5 error or transfer complete
  EDMA_1_CH6_IRQHandler,                       //eDMA_1_CH6 error or transfer complete
  EDMA_1_CH7_IRQHandler,                       //eDMA_1_CH7 error or transfer complete
  EDMA_1_CH8_IRQHandler,                       //eDMA_1_CH8 error or transfer complete
  EDMA_1_CH9_IRQHandler,                       //eDMA_1_CH9 error or transfer complete
  EDMA_1_CH10_IRQHandler,                      //eDMA_1_CH10 error or transfer complete
  EDMA_1_CH11_IRQHandler,                      //eDMA_1_CH11 error or transfer complete
  EDMA_1_CH12_IRQHandler,                      //eDMA_1_CH12 error or transfer complete
  EDMA_1_CH13_IRQHandler,                      //eDMA_1_CH13 error or transfer complete
  EDMA_1_CH14_IRQHandler,                      //eDMA_1_CH14 error or transfer complete
  EDMA_1_CH15_IRQHandler,                      //eDMA_1_CH15 error or transfer complete
  CDOG0_IRQHandler,                            //Code Watchdog Timer 0 interrupt
  CDOG1_IRQHandler,                            //Code Watchdog Timer 1 interrupt
  I3C0_IRQHandler,                             //Improved Inter Integrated Circuit interrupt 0
  I3C1_IRQHandler,                             //Improved Inter Integrated Circuit interrupt 1
  NPU_IRQHandler,                              //NPU interrupt
  GDET_IRQHandler,                             //Digital Glitch Detect 0 interrupt  or Digital Glitch Detect 1 interrupt
  VBAT0_IRQHandler,                            //VBAT interrupt( VBAT interrupt or digital tamper interrupt)
  EWM0_IRQHandler,                             //External Watchdog Monitor interrupt
  TSI_END_OF_SCAN_IRQHandler,                  //TSI End of Scan interrupt
  TSI_OUT_OF_SCAN_IRQHandler,                  //TSI Out of Scan interrupt
  EMVSIM0_IRQHandler,                          //EMVSIM0 interrupt
  EMVSIM1_IRQHandler,                          //EMVSIM1 interrupt
  FLEXIO_IRQHandler,                           //Flexible Input/Output interrupt
  DAC0_IRQHandler,                             //Digital-to-Analog Converter 0 - General Purpose interrupt
  DAC1_IRQHandler,                             //Digital-to-Analog Converter 1 - General Purpose interrupt
  DAC2_IRQHandler,                             //14-bit Digital-to-Analog Converter interrupt
  HSCMP0_IRQHandler,                           //High-Speed comparator0 interrupt
  HSCMP1_IRQHandler,                           //High-Speed comparator1 interrupt
  HSCMP2_IRQHandler,                           //High-Speed comparator2 interrupt
  FLEXPWM0_RELOAD_ERROR_IRQHandler,            //FlexPWM0_reload_error interrupt
  FLEXPWM0_FAULT_IRQHandler,                   //FlexPWM0_fault interrupt
  FLEXPWM0_SUBMODULE0_IRQHandler,              //FlexPWM0 Submodule 0 capture/compare/reload interrupt
  FLEXPWM0_SUBMODULE1_IRQHandler,              //FlexPWM0 Submodule 1 capture/compare/reload interrupt
  FLEXPWM0_SUBMODULE2_IRQHandler,              //FlexPWM0 Submodule 2 capture/compare/reload interrupt
  FLEXPWM0_SUBMODULE3_IRQHandler,              //FlexPWM0 Submodule 3 capture/compare/reload interrupt
  FLEXPWM1_RELOAD_ERROR_IRQHandler,            //FlexPWM1_reload_error interrupt
  FLEXPWM1_FAULT_IRQHandler,                   //FlexPWM1_fault interrupt
  FLEXPWM1_SUBMODULE0_IRQHandler,              //FlexPWM1 Submodule 0 capture/compare/reload interrupt
  FLEXPWM1_SUBMODULE1_IRQHandler,              //FlexPWM1 Submodule 1 capture/compare/reload interrupt
  FLEXPWM1_SUBMODULE2_IRQHandler,              //FlexPWM1 Submodule 2 capture/compare/reload interrupt
  FLEXPWM1_SUBMODULE3_IRQHandler,              //FlexPWM1 Submodule 3 capture/compare/reload interrupt
  ENC0_COMPARE_IRQHandler,                     //ENC0_Compare interrupt
  ENC0_HOME_IRQHandler,                        //ENC0_Home interrupt
  ENC0_WDG_SAB_IRQHandler,                     //ENC0_WDG_IRQ/SAB interrupt
  ENC0_IDX_IRQHandler,                         //ENC0_IDX interrupt
  ENC1_COMPARE_IRQHandler,                     //ENC1_Compare interrupt
  ENC1_HOME_IRQHandler,                        //ENC1_Home interrupt
  ENC1_WDG_SAB_IRQHandler,                     //ENC1_WDG_IRQ/SAB interrupt
  ENC1_IDX_IRQHandler,                         //ENC1_IDX interrupt
  ITRC0_IRQHandler,                            //Intrusion and Tamper Response Controller interrupt
  BSP32_IRQHandler,                            //CoolFlux BSP32 interrupt
  ELS_ERR_IRQHandler,                          //ELS error interrupt
  PKC_ERR_IRQHandler,                          //PKC error interrupt
  ERM_SINGLE_BIT_ERROR_IRQHandler,             //ERM Single Bit error interrupt
  ERM_MULTI_BIT_ERROR_IRQHandler,              //ERM Multi Bit error interrupt
  FMU0_IRQHandler,                             //Flash Management Unit interrupt
  ETHERNET_IRQHandler,                         //Ethernet QoS interrupt
  ETHERNET_PMT_IRQHandler,                     //Ethernet QoS power management interrupt
  ETHERNET_MACLP_IRQHandler,                   //Ethernet QoS MAC interrupt
  SINC_FILTER_IRQHandler,                      //SINC Filter interrupt
  LPTMR0_IRQHandler,                           //Low Power Timer 0 interrupt
  LPTMR1_IRQHandler,                           //Low Power Timer 1 interrupt
  SCG_IRQHandler,                              //System Clock Generator interrupt
  SPC_IRQHandler,                              //System Power Controller interrupt
  WUU_IRQHandler,                              //Wake Up Unit interrupt
  PORT_EFT_IRQHandler,                         //PORT0~5 EFT interrupt
  ETB0_IRQHandler,                             //ETB counter expires interrupt
  SM3_IRQHandler,                              //Secure Generic Interface (SGI) SAFO interrupt
  TRNG0_IRQHandler,                            //True Random Number Generator interrupt
  WWDT0_IRQHandler,                            //Windowed Watchdog Timer 0 interrupt
  WWDT1_IRQHandler,                            //Windowed Watchdog Timer 1 interrupt
  CMC0_IRQHandler,                             //Core Mode Controller interrupt
  CTI0_IRQHandler,                             //Cross Trigger Interface interrupt
};

#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
void Reset_Handler(void)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __disable_irq();
#endif
    __set_PSP((uint32_t)(&__INITIAL_SP));

    __set_MSPLIM((uint32_t)(&__STACK_LIMIT));
    __set_PSPLIM((uint32_t)(&__STACK_LIMIT));

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __TZ_set_STACKSEAL_S((uint32_t *)(&__STACK_SEAL));
#endif

    SystemInit();                             /* CMSIS System Initialization */
    __PROGRAM_START();                        /* Enter PreMain (C library entry point) */
}
